tests/cassettes/webservice/rms/test_order/test_rms_order.yaml

interactions:
- request:
    body: "<?xml version='1.0' encoding='utf-8'?>\n<soap-env:Envelope xmlns:soap-env=\"http://schemas.xmlsoap.org/soap/envelope/\">\n
      \ <soap-env:Body>\n    <ns0:getRequestId xmlns:ns0=\"http://orderapi.rms.rakuten.co.jp/rms/mall/order/api/ws\">\n
      \     <arg0>\n        <authKey>XXXXXX</authKey>\n        <shopUrl>XXXXXX</shopUrl>\n
      \       <userName>XXXXXX</userName>\n      </arg0>\n    </ns0:getRequestId>\n
      \ </soap-env:Body>\n</soap-env:Envelope>\n"
    headers:
      Accept: ['*/*']
      Accept-Encoding: ['gzip, deflate']
      Connection: [keep-alive]
      Content-Length: ['486']
      Content-Type: [text/xml; charset=utf-8]
      SOAPAction: ['""']
      User-Agent: [Zeep/1.1.0 (www.python-zeep.org)]
    method: POST
    uri: https://api.rms.rakuten.co.jp/es/1.0/order/ws
  response:
    body:
      string: !!binary |
        H4sIAAAAAAAAA3WQO07DQBCGr2KlcZWdjRESstYbCQQSDUUCB1jZI8dg7yw76wAtBRehpkSKOA+P
        a7BWYlxRjDT65p9/Hmr52LXJFj03ZIt0IWSaoC2pamxdpDfXF/OTdKnVOj+3W2zJYRL1lvN1MduE
        4HIALjfYGRaRMxknyNcwJICHDpgN/adUPWllOctrDCu875HDZbVCdmR5dI3lP1/yFXrjGuE7Ft7c
        9QGtKEncOogEOtO2ew1EETxwnOIx9N5qhd6TP6MK9ZWUcymlggmpDplNjfr77fVrt/t5f/78eFEw
        0mhy2E1nRzKLsThWMMEh30+B/46JpfFemB6nfwHYoLNuawEAAA==
    headers:
      Connection: [close]
      Content-Encoding: [gzip]
      Content-Length: ['265']
      Content-Type: [text/xml;charset="utf-8"]
      Date: ['Mon, 20 Feb 2017 15:36:35 GMT']
      Server: [nginx]
      Vary: [Accept-Encoding]
      X-Powered-By: [Servlet/2.5 JSP/2.1]
      requestId: [8e010703-90c1-423e-bf1b-1b7df96af87e]
      timeStamp: ['2017-02-20T15:36:34']
    status: {code: 200, message: OK}
version: 1
